{
  "heureux": [
    {
      "arabic": "وَبَشِّرِ الصَّابِرِينَ",
      "french": "Et annonce la bonne nouvelle aux patients",
      "surah": "Al-Baqarah",
      "verse_number": "155",
      "explanation": "Ce verset nous rappelle que la patience est récompensée par Allah. Même dans les moments de joie, la patience reste une vertu précieuse.",
      "conclusion": "Continue à être patient(e) et joyeux/joyeuse, Allah te récompensera pour ta constance et ta gratitude."
    },
    {
      "arabic": "وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مَخْرَجًا",
      "french": "Et quiconque craint Allah, Il lui donnera une issue favorable",
      "surah": "At-Talaq",
      "verse_number": "2",
      "explanation": "Allah promet une issue favorable à ceux qui Le craignent et Lui obéissent.",
      "conclusion": "Ta joie est un signe de la bénédiction d'Allah. Continue sur ce chemin de piété et de gratitude."
    }
  ],
  "triste": [
    {
      "arabic": "وَلَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا",
      "french": "Ne t'attriste pas, Allah est avec nous",
      "surah": "At-Tawbah",
      "verse_number": "40",
      "explanation": "Ces mots furent prononcés par le Prophète (ﷺ) à Abu Bakr dans la grotte. Allah est toujours avec nous dans les moments difficiles.",
      "conclusion": "N'aie pas de tristesse, Allah veille sur toi et ne t'abandonnera jamais. Cette épreuve passera."
    },
    {
      "arabic": "وَبَشِّرِ الصَّابِرِينَ الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ",
      "french": "Et annonce la bonne nouvelle aux endurants qui disent, quand un malheur les atteint : 'Certes nous sommes à Allah, et c'est à Lui que nous retournerons'",
      "surah": "Al-Baqarah",
      "verse_number": "155-156",
      "explanation": "La patience dans l'épreuve est récompensée par Allah. Accepter que tout vient d'Allah apporte la paix.",
      "conclusion": "Ta tristesse est temporaire. Sois patient(e), Allah te récompensera pour ton endurance."
    }
  ],
  "anxieux": [
    {
      "arabic": "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
      "french": "N'est-ce point par l'évocation d'Allah que se tranquillisent les cœurs ?",
      "surah": "Ar-Ra'd",
      "verse_number": "28",
      "explanation": "Le rappel d'Allah (dhikr) est le meilleur remède contre l'anxiété et l'inquiétude.",
      "conclusion": "Apaise ton cœur par le dhikr. Répète 'La hawla wa la quwwata illa billah' et trouve la sérénité."
    },
    {
      "arabic": "وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ",
      "french": "Et quiconque place sa confiance en Allah, Il lui suffit",
      "surah": "At-Talaq",
      "verse_number": "3",
      "explanation": "Placer sa confiance en Allah libère de l'anxiété car on sait qu'Il s'occupe de tout.",
      "conclusion": "Remets tes soucis à Allah. Il connaît ta situation mieux que toi et Il t'aidera."
    }
  ],
  "reconnaissant": [
    {
      "arabic": "لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ",
      "french": "Si vous êtes reconnaissants, très certainement J'augmenterai [Mes bienfaits] pour vous",
      "surah": "Ibrahim",
      "verse_number": "7",
      "explanation": "Allah promet d'augmenter Ses bienfaits pour ceux qui Lui sont reconnaissants.",
      "conclusion": "Ta gratitude est bénie. Continue à remercier Allah, Il multipliera Ses faveurs sur toi."
    },
    {
      "arabic": "وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ",
      "french": "Remerciez-Moi donc et ne soyez pas ingrats envers Moi",
      "surah": "Al-Baqarah",
      "verse_number": "152",
      "explanation": "Allah nous demande d'être reconnaissants et de ne pas oublier Ses bienfaits.",
      "conclusion": "Ta reconnaissance est un acte d'adoration. Continue à voir les bénédictions d'Allah dans ta vie."
    }
  ],
  "fatigué": [
    {
      "arabic": "وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ الْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ",
      "french": "Ne vous laissez pas abattre, ne vous affligez pas : vous êtes les supérieurs, si vous êtes croyants",
      "surah": "Ali 'Imran",
      "verse_number": "139",
      "explanation": "Allah encourage les croyants à ne pas se laisser abattre par la fatigue ou les difficultés.",
      "conclusion": "Reprends des forces. Ta foi te donne la supériorité sur tes épreuves. Repose-toi et fais confiance à Allah."
    },
    {
      "arabic": "وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مِنْ أَمْرِهِ يُسْرًا",
      "french": "Et quiconque craint Allah, Il lui facilite les choses",
      "surah": "At-Talaq",
      "verse_number": "4",
      "explanation": "Allah facilite les affaires de ceux qui Le craignent, même quand ils sont fatigués.",
      "conclusion": "Allah va t'accorder la facilité. Repose-toi et aie confiance, Il allègera ton fardeau."
    }
  ],
  "serein": [
    {
      "arabic": "الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ",
      "french": "Ceux qui ont cru, et dont les cœurs se tranquillisent à l'évocation d'Allah",
      "surah": "Ar-Ra'd",
      "verse_number": "28",
      "explanation": "La sérénité vient de la foi et du rappel constant d'Allah.",
      "conclusion": "Ta sérénité est un don d'Allah. Continue à Le remémorer pour maintenir cette paix intérieure."
    },
    {
      "arabic": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ",
      "french": "Souvenez-vous de Moi donc. Je Me souviendrai de vous. Remerciez-Moi et ne soyez pas ingrats",
      "surah": "Al-Baqarah",
      "verse_number": "152",
      "explanation": "Le rappel mutuel entre Allah et le croyant apporte une paix profonde.",
      "conclusion": "Profite de cette sérénité pour te rapprocher d'Allah. Il Se souvient de toi comme tu te souviens de Lui."
    }
  ],
  "en_colere": [
    {
      "arabic": "وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ",
      "french": "Qui dominent leur rage, pardonnent à autrui - car Allah aime les bienfaisants",
      "surah": "Ali 'Imran",
      "verse_number": "134",
      "explanation": "Maîtriser sa colère et pardonner sont des qualités que Allah aime chez Ses serviteurs.",
      "conclusion": "Transforme ta colère en patience. Le pardon t'élèvera auprès d'Allah et t'apportera la paix."
    },
    {
      "arabic": "وَإِذَا مَا غَضِبُوا هُمْ يَغْفِرُونَ",
      "french": "Et qui, lorsqu'ils sont en colère, pardonnent",
      "surah": "Ash-Shura",
      "verse_number": "37",
      "explanation": "Les vrais croyants sont ceux qui savent pardonner même dans la colère.",
      "conclusion": "Ta colère peut devenir une force si tu choisis le pardon. Allah récompense ceux qui maîtrisent leurs émotions."
    }
  ],
  "decourage": [
    {
      "arabic": "وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ إِنَّهُ لَا يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ",
      "french": "Et ne désespérez pas de la miséricorde d'Allah. Il n'y a que les gens mécréants qui désespèrent de la miséricorde d'Allah",
      "surah": "Yusuf",
      "verse_number": "87",
      "explanation": "Le désespoir de la miséricorde d'Allah est interdit au croyant. Il y a toujours de l'espoir.",
      "conclusion": "Ne perds jamais espoir. Allah peut changer ta situation en un instant. Sa miséricorde est infinie."
    },
    {
      "arabic": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا إِنَّ مَعَ الْعُسْرِ يُسْرًا",
      "french": "A côté de la difficulté est, certes, une facilité. A côté de la difficulté est, certes, une facilité",
      "surah": "Ash-Sharh",
      "verse_number": "5-6",
      "explanation": "Allah répète deux fois que la facilité accompagne la difficulté, montrant que le soulagement est certain.",
      "conclusion": "Après chaque difficulté vient la facilité. Ton découragement se transformera bientôt en joie, par la grâce d'Allah."
    }
  ],
  "malade": [
    {
      "arabic": "وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ",
      "french": "Et quand je suis malade, c'est Lui qui me guérit",
      "surah": "Ash-Shu'ara",
      "verse_number": "80",
      "explanation": "Ibrahim (paix sur lui) reconnaît qu'Allah seul est le véritable guérisseur.",
      "conclusion": "Demande la guérison à Allah, le Guérisseur suprême. Il connaît ton mal et possède le remède."
    },
    {
      "arabic": "وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِّلْمُؤْمِنِينَ",
      "french": "Nous faisons descendre du Coran, ce qui est une guérison et une miséricorde pour les croyants",
      "surah": "Al-Isra",
      "verse_number": "82",
      "explanation": "Le Coran est une guérison spirituelle et parfois physique pour ceux qui y croient.",
      "conclusion": "Lis le Coran et fais des invocations. Allah peut te guérir par Sa parole et Sa miséricorde."
    }
  ]
}